;
$(function() {

	var right='<div class="right"><div class="brands clear"><a href="#"><img src="products/cate/1/1.jpg" height="35" width="83"></a><a href="#"><img src="products/cate/1/2.jpg" height="35" width="83"></a><a href="#"><img src="products/cate/1/3.jpg" height="35" width="83"></a><a href="#"><img src="products/cate/1/4.jpg" height="35" width="83"></a><a href="#"><img src="products/cate/1/5.jpg" height="35" width="83"></a><a href="#"><img src="products/cate/1/6.jpg" height="35" width="83"></a><a href="#"><img src="products/cate/1/7.jpg" height="35" width="83"></a><a href="#"><img src="products/cate/1/8.jpg" height="35" width="83"></a></div><div class="ads"><a href="#" target="_blank"><img src="products/cate/1/9.jpg" height="134" width="168"></a><a href="#" target="_blank"><img src="products/cate/1/10.jpg" height="134" width="168"></a></div></div>';

	var categoryDD=$('#category-dd');
	categoryDD.html('');

	var cate_tits = [
		['品牌日<i>&gt;</i>', '家电城<i>&gt;</i>', '智能生活馆<i>&gt;</i>', '京东净化馆<i>&gt;</i>', '京东帮服务店<i>&gt;</i>', '值得买精选<i>&gt;</i>'],
		['手机频道<i>&gt;</i>', '网上营业厅<i>&gt;</i>', '配件城<i>&gt;</i>', '影像Club<i>&gt;</i>', '手机社区<i>&gt;</i>', '以旧换新<i>&gt;</i>'],
		['本周热卖<i>&gt;</i>', '游戏部落<i>&gt;</i>', '智能社区<i>&gt;</i>', 'GAME+<i>&gt;</i>', '装机大师<i>&gt;</i>', '办公生活馆<i>&gt;</i>'],
		['家装城<i>&gt;</i>', '居家日用<i>&gt;</i>', '精品家具<i>&gt;</i>', '家装建材<i>&gt;</i>', '厨房达人<i>&gt;</i>', '猫猫狗狗<i>&gt;</i>', '家装节<i>&gt;</i>'],
		['男装<i>&gt;</i>', '女装<i>&gt;</i>', '内衣<i>&gt;</i>', '珠宝<i>&gt;</i>', '国际品牌<i>&gt;</i>', '设计师<i>&gt;</i>'],
		['美妆商城<i>&gt;</i>', '美妆特卖<i>&gt;</i>'],
		['男鞋<i>&gt;</i>', '女鞋<i>&gt;</i>', '箱包<i>&gt;</i>', '钟表<i>&gt;</i>', '奢侈品<i>&gt;</i>', '皮具城<i>&gt;</i>'],
		['运动城<i>&gt;</i>', '户外馆<i>&gt;</i>', '渔乐圈<i>&gt;</i>', '篮球馆<i>&gt;</i>', '健身房<i>&gt;</i>', '骑行馆<i>&gt;</i>'],
		['全新汽车<i>&gt;</i>', '汽车用品<i>&gt;</i>', '旗舰店<i>&gt;</i>', '二手车<i>&gt;</i>'],
		['母婴<i>&gt;</i>', '玩具乐器<i>&gt;</i>', '品牌街<i>&gt;</i>', '亲子馆<i>&gt;</i>', '全球购母婴<i>&gt;</i>', '大牌特卖<i>&gt;</i>'],
		['食品饮料<i>&gt;</i>', '酒类<i>&gt;</i>', '生鲜<i>&gt;</i>', '地方特产<i>&gt;</i>', '全球购美食<i>&gt;</i>'],
		['保健食品<i>&gt;</i>', '滋补养生<i>&gt;</i>', '膳食补充<i>&gt;</i>', '健康监测<i>&gt;</i>', '两性情话<i>&gt;</i>', '靓眼视界<i>&gt;</i>'],
		['图书频道<i>&gt;</i>', '音像<i>&gt;</i>', '电子书<i>&gt;</i>', '图书榜<i>&gt;</i>', '音乐榜<i>&gt;</i>', '影视榜<i>&gt;</i>'],
		['充值缴费<i>&gt;</i>', '京东彩票<i>&gt;</i>', '培训教育<i>&gt;</i>', '优选机票<i>&gt;</i>', '旅行签证<i>&gt;</i>', '京东游戏<i>&gt;</i>'],
		['金融首页<i>&gt;</i>', '尖儿货<i>&gt;</i>', '众筹<i>&gt;</i>', '理财<i>&gt;</i>', '玩bigger<i>&gt;</i>', '京东钱包<i>&gt;</i>']
	];
	var dts = [
		['大家电<i>&gt;</i>', '生活电器<i>&gt;</i>', '厨房电器<i>&gt;</i>', '个护健康<i>&gt;</i>', '五金家装<i>&gt;</i>'],
		['手机通讯<i>&gt;</i>', '京东通信<i>&gt;</i>', '运营商<i>&gt;</i>', '手机配件<i>&gt;</i>', '摄影摄像<i>&gt;</i>', '数码配件<i>&gt;</i>', '影音娱乐<i>&gt;</i>', '智能设备<i>&gt;</i>', '电子教育<i>&gt;</i>'],
		['电脑整机<i>&gt;</i>', '电脑配件<i>&gt;</i>', '外设产品<i>&gt;</i>', '游戏设备<i>&gt;</i>', '网络产品<i>&gt;</i>', '办公设备<i>&gt;</i>', '文具耗材<i>&gt;</i>', '服务产品<i>&gt;</i>'],
		['厨具<i>&gt;</i>', '家装建材<i>&gt;</i>', '家纺<i>&gt;</i>', '家具<i>&gt;</i>', '灯具<i>&gt;</i>', '生活日用<i>&gt;</i>', '家装软饰<i>&gt;</i>', '宠物生活<i>&gt;</i>'],
		['女装<i>&gt;</i>', '男装<i>&gt;</i>', '内衣<i>&gt;</i>', '配饰<i>&gt;</i>', '珠宝首饰<i>&gt;</i>'],
		['面部护肤<i>&gt;</i>', '洗发护发<i>&gt;</i>', '身体护肤<i>&gt;</i>', '口腔护理<i>&gt;</i>', '女性护理<i>&gt;</i>', '香水彩妆<i>&gt;</i>', '清洁用品<i>&gt;</i>'],
		['时尚女鞋<i>&gt;</i>', '流行男鞋<i>&gt;</i>', '潮流女包<i>&gt;</i>', '精品男包<i>&gt;</i>', '功能箱包<i>&gt;</i>', '奢侈品<i>&gt;</i>', '钟表<i>&gt;</i>', '礼品<i>&gt;</i>'],
		['运动鞋包<i>&gt;</i>', '运动服饰<i>&gt;</i>', '健身训练<i>&gt;</i>', '骑行运动<i>&gt;</i>', '体育用品<i>&gt;</i>', '户外鞋服<i>&gt;</i>', '户外装备<i>&gt;</i>', '垂钓用品<i>&gt;</i>', '游泳用品<i>&gt;</i>'],
		['汽车车型<i>&gt;</i>', '汽车价格<i>&gt;</i>', '汽车品牌<i>&gt;</i>', '维修保养<i>&gt;</i>', '车载电器<i>&gt;</i>', '美容清洗<i>&gt;</i>', '汽车装饰<i>&gt;</i>', '安全自驾<i>&gt;</i>', '线下服务<i>&gt;</i>'],
		['奶粉<i>&gt;</i>', '营养辅食<i>&gt;</i>', '尿裤湿巾<i>&gt;</i>', '洗护用品<i>&gt;</i>', '喂养用品<i>&gt;</i>', '童车童床<i>&gt;</i>', '安全座椅<i>&gt;</i>', '寝居服饰<i>&gt;</i>', '妈妈专区<i>&gt;</i>', '童装童鞋<i>&gt;</i>', '玩具乐器<i>&gt;</i>'],
		['中外名酒<i>&gt;</i>', '进口食品<i>&gt;</i>', '休闲食品<i>&gt;</i>', '地方特产<i>&gt;</i>', '茗茶<i>&gt;</i>', '饮料冲调<i>&gt;</i>', '粮油调味<i>&gt;</i>', '生鲜食品<i>&gt;</i>', '食品礼券<i>&gt;</i>'],
		['营养健康<i>&gt;</i>', '营养成分<i>&gt;</i>', '滋补养生<i>&gt;</i>', '成人用品<i>&gt;</i>', '保健器械<i>&gt;</i>', '护理护具<i>&gt;</i>'],
		['音像<i>&gt;</i>', '少儿<i>&gt;</i>', '教育<i>&gt;</i>', '人文社科<i>&gt;</i>', '生活<i>&gt;</i>', '科技<i>&gt;</i>', '电子书<i>&gt;</i>', '数字音乐<i>&gt;</i>'],
		['彩票<i>&gt;</i>', '通讯充值<i>&gt;</i>', '游戏<i>&gt;</i>', '本地生活<i>&gt;</i>', '演出票务<i>&gt;</i>', '教育培训<i>&gt;</i>', '商旅服务<i>&gt;</i>', '机票预订<i>&gt;</i>', '酒店预订<i>&gt;</i>', '旅游度假<i>&gt;</i>', '签证门票<i>&gt;</i>', '租车服务<i>&gt;</i>'],
		['理财<i>&gt;</i>', '众筹<i>&gt;</i>', '白条<i>&gt;</i>', '钱包<i>&gt;</i>', '保险<i>&gt;</i>']
	];
	var dds =
		[
			[
				['平板电视', '空调', '冰箱', '洗衣机', '家庭影院', 'DVD', '迷你音响', '烟机/灶具', '热水器', '消毒柜/洗碗机', '冷柜/冰吧', '酒柜', '家电配件'],
				['电风扇', '冷风扇', '净化器', '加湿器', '扫地机器人', '吸尘器', '挂烫机/熨斗', '插座', '电话机', '清洁机', '除湿机', '干衣机', '收录/音机', '取暖电器', '其它生活电器', '生活电器配件', '净水设备', '饮水机'],
				['电压力锅', '电饭煲', '豆浆机', '面包机', '咖啡机', '微波炉', '料理/榨汁机', '电烤箱', '电磁炉', '电饼铛/烧烤盘', '煮蛋器', '酸奶机', '电水壶/热水瓶', '电炖锅', '多用途锅', '果蔬解毒机', '养生壶/煎药壶', '电热饭盒', '其它厨房电器'],
				['剃须刀', '剃/脱毛器', '口腔护理', '电吹风', '美容器', '理发器', '卷/直发器', '按摩椅', '按摩器', '足浴盆', '血压计', '健康秤/厨房秤', '血糖仪', '体温计', '计步器/脂肪检测仪', '其它健康电器'],
				['电动工具', '手动工具', '仪器仪表', '浴霸/排气扇', '灯具', 'LED灯', '洁身器', '水槽', '龙头', '淋浴花洒', '厨卫五金', '家具五金', '门铃', '电气开关', '插座', '电工电料', '监控安防', '电线/线缆']
			],
			[
				['手机', '对讲机', '以旧换新'],
				['选号中心', '自助服务'],
				['合约机', '办套餐', '选号码', '装宽带', '中国移动', '中国联通', '中国电信'],
				['电池/移动电源', '蓝牙耳机', '充电器/数据线', '手机耳机', '手机支架', '贴膜', '存储卡', '保护套', '车载', 'iPhone配件', '创意配件', '便携/无线音箱', '手机饰品', '拍照配件'],
				['数码相机', '单电/微单相机', '单反相机', '拍立得', '运动相机', '摄像机', '镜头', '户外器材', '影棚器材', '冲印服务', '数码相框'],
				['存储卡', '读卡器', '支架', '滤镜', '闪光灯/手柄', '相机包', '三脚架/云台', '相机清洁/贴膜', '机身附件', '镜头附件', '电池/充电器', '移动电源'],
				['耳机/耳麦', '音箱/音响', '收音机', '麦克风', 'MP3/MP4', '专业音频', '苹果周边'],
				['智能手环', '智能手表', '智能眼镜', '智能机器人', '运动跟踪器', '健康监测', '智能配饰', '智能家居', '体感车', '无人机', '其他配件'],
				['学生平板', '点读机/笔', '早教益智', '录音笔', '电纸书', '电子词典', '复读机']
			],
			[
				['笔记本', '超极本', '游戏本', '平板电脑', '平板电脑配件', '台式机', '一体机', '服务器/工作站', '笔记本配件'],
				['CPU', '主板', '显卡', '硬盘', 'SSD固态硬盘', '内存', '机箱', '电源', '显示器', '刻录机/光驱', '声卡/扩展卡', '散热器', '装机配件', '组装电脑'],
				['鼠标', '键盘', '网络仪表仪器', 'U盘', '移动硬盘', '鼠标垫', '摄像头', '线缆', '电玩', '手写板', '外置盒', '电脑工具', '电脑清洁', 'UPS', '插座'],
				['游戏机', '游戏耳机', '手柄/方向盘', '游戏软件', '游戏周边'],
				['路由器', '网卡', '交换机', '网络存储', '4G/3G上网', '网络盒子', '网络配件'],
				['投影机', '投影配件', '多功能一体机', '打印机', '传真设备', '验钞/点钞机', '扫描设备', '复合机', '碎纸机', '考勤机', '收款/POS机', '会议音频视频', '保险柜', '装订/封装机', '安防监控', '办公家具', '白板'],
				['硒鼓/墨粉', '墨盒', '色带', '纸类', '办公文具', '学生文具', '文件管理', '本册/便签', '计算器', '笔类', '画具画材', '财会用品', '刻录碟片/附件'],
				['延保服务', '上门安装', '维修保养', '电脑软件']
			],
			[
				['烹饪锅具', '刀剪菜板', '厨房配件', '水具酒具', '餐具', '茶具/咖啡具'],
				['<img src="//img10.360buyimg.com/vclist/jfs/t1705/327/1146391539/3797/df3a7e7d/55e400a1N1f02f3c8.jpg" data-lazy-img="done" height="16">', '灯饰照明', '厨房卫浴', '五金工具', '电工电料', '墙地面材料', '装饰材料', '装修服务', '吸顶灯', '淋浴花洒', '开关插座', '油漆涂料', '龙头'],
				['床品套件', '被子', '枕芯', '床单被罩', '床垫/床褥', '电热毯', '毯子', '毛巾浴巾', '抱枕靠垫', '布艺软饰', '窗帘/窗纱', '蚊帐', '凉席'],
				['<img src="//img11.360buyimg.com/vclist/jfs/t1738/79/1307947994/3791/7e3b729a/55e400f4N4223e7e7.jpg" data-lazy-img="done" height="16">', '卧室家具', '客厅家具', '餐厅家具', '书房家具', '储物家具', '阳台/户外', '商业办公', '床', '床垫', '沙发', '电脑椅', '衣柜', '茶几', '电视柜', '餐桌', '电脑桌', '鞋架/衣帽架'],
				['台灯', '吸顶灯', '筒灯射灯', 'LED灯', '节能灯', '落地灯', '五金电器', '应急灯/手电', '装饰灯', '吊灯', '氛围照明'],
				['收纳用品', '雨伞雨具', '浴室用品', '缝纫/针织用品', '洗晒/熨烫', '净化除味', '清洁工具'],
				['<img src="//img12.360buyimg.com/vclist/jfs/t1834/16/1228184210/3788/93099681/55e4013dN7511d1e7.jpg" data-lazy-img="done" height="16">', '桌布/罩件', '地毯地垫', '沙发垫套/椅垫', '帘艺隔断', '相框/照片墙', '装饰字画', '墙贴/装饰贴', '节庆饰品', '手工/十字绣', '钟饰', '装饰摆件', '花瓶花艺', '创意家居', '保暖防护', '香薰蜡烛'],
				['宠物主粮', '宠物零食', '洗护美容', '家居日用', '医疗保健', '出行装备', '宠物玩具', '水族用品', '猫砂/尿布', '宠物牵引', '宠物驱虫']
			],
			[
				['连衣裙', '针织衫', '卫衣', '风衣', '毛呢大衣', '羊毛衫', '短外套', '小西装', 'T恤', '衬衫', '打底衫', '打底裤', '羊绒衫', '棉服', '羽绒服', '皮草', '马甲', '中老年女装', '大码女装', '真皮皮衣', '仿皮皮衣', '雪纺衫', '短裤', '牛仔裤', '休闲裤', '正装裤', '半身裙', '加绒裤', '婚纱', '旗袍/唐装', '礼服', '吊带/背心', '设计师/潮牌'],
				['衬衫', '牛仔裤', '夹克', '休闲裤', 'T恤', '卫衣', '羽绒服', '针织衫', '棉服', '西服', '马甲/背心', 'POLO衫', '风衣', '真皮皮衣', '毛呢大衣', '仿皮皮衣', '西服套装', '羊毛衫', '西裤', '羊绒衫', '大码男装', '卫裤/运动裤', '设计师/潮牌', '加绒裤', '中老年男装', '工装', '短裤', '唐装/中山装'],
				['文胸', '睡衣/家居服', '男式内裤', '女式内裤', '商务男袜', '休闲棉袜', '情侣睡衣', '文胸套装', '大码内衣', '秋衣秋裤', '保暖内衣', '连裤袜/丝袜', '打底衫', '美腿袜', '少女文胸', '抹胸', '吊带/背心', '内衣配件', '泳衣', '塑身美体', '打底裤袜', '情趣内衣'],
				['女士丝巾/围巾/披肩', '男士腰带/礼盒', '太阳镜', '女士腰带/礼盒', '老花镜', '游泳镜', '装饰眼镜', '真皮手套', '男士丝巾/围巾', '毛线帽', '毛线手套', '礼帽', '贝雷帽', '棒球帽', '袖扣', '耳罩/耳包', '光学镜架/镜片', '口罩', '领带/领结/领带夹', '鸭舌帽', '遮阳帽', '遮阳伞/雨伞', '防晒手套', '防辐射眼镜', '毛线/布面料', '假领', '围巾/手套/帽子套装', '钥匙扣'],
				['时尚饰品', '钻石', '翡翠玉石', '纯金K金饰品', '金银投资', '银饰', '水晶玛瑙', '彩宝', '铂金', '天然木饰', '珍珠']
			],
			[
				['清洁', '护肤', '面膜', '剃须', '套装'],
				['洗发', '护发', '染发', '造型', '假发', '套装'],
				['沐浴', '润肤', '颈部', '手足', '纤体塑形', '美胸', '套装'],
				['牙膏/牙粉', '牙刷/牙线', '漱口水', '套装'],
				['卫生巾', '卫生护垫', '私密护理', '脱毛膏'],
				['香水', '底妆', '腮红', '眼部', '唇部', '美甲', '美容工具', '套装'],
				['纸品湿巾', '衣物清洁', '清洁工具', '家庭清洁', '一次性用品', '驱虫用品', '皮具护理']
			],
			[
				['女靴', '踝靴', '马丁靴', '雪地靴', '帆布鞋', '妈妈鞋', '内增高', '松糕鞋', '布鞋/绣花鞋', '凉鞋', '拖鞋/人字拖', '单鞋', '休闲鞋', '高跟鞋', '防水台', '坡跟鞋', '鱼嘴鞋', '雨鞋/雨靴', '鞋配件'],
				['休闲鞋', '商务休闲鞋', '正装鞋', '帆布鞋', '工装鞋', '增高鞋', '拖鞋/人字拖', '凉鞋/沙滩鞋', '雨鞋/雨靴', '定制鞋', '男靴', '传统布鞋', '功能鞋', '鞋配件'],
				['单肩包', '手提包', '斜挎包', '双肩包', '钱包', '手拿包/晚宴包', '卡包/零钱包', '钥匙包'],
				['商务公文包', '单肩/斜挎包', '男士手包', '双肩包', '钱包/卡包', '钥匙包'],
				['拉杆箱/拉杆包', '旅行包', '电脑包', '休闲运动包', '相机包', '腰包/胸包', '登山包', '旅行配件', '书包', '妈咪包'],
				['箱包', '钱包', '服饰', '腰带', '鞋靴', '太阳镜/眼镜框', '饰品', '配件'],
				['男表', '女表', '儿童表', '智能手表', '座钟挂钟'],
				['火机烟具', '军刀军具', '美妆礼品', '工艺礼品', '礼盒礼券', '礼品文具', '收藏品', '古董把玩', '礼品定制', '创意礼品', '婚庆用品', '鲜花绿植', '京东卡']
			],
			[
				['<img src="//img13.360buyimg.com/vclist/jfs/t1894/153/217907619/2160/dea09c76/55f7e4f9Ne0bec888.png" data-lazy-img="done" height="16">', '跑步鞋', '休闲鞋', '篮球鞋', '帆布鞋', '拖鞋', '运动包', '板鞋', '足球鞋', '训练鞋', '乒羽网鞋', '专项运动鞋'],
				['T恤', '运动套装', '运动裤', '运动配饰', '运动背心', '夹克/风衣', '卫衣/套头衫', '训练服', '乒羽网服', '毛衫/线衫', '棉服', '羽绒服'],
				['<img src="//img14.360buyimg.com/vclist/jfs/t2014/235/297573613/2242/3ef9851f/55ff5a4bN5e32c810.png" data-lazy-img="done" height="16">', '跑步机', '健身车/动感单车', '哑铃', '仰卧板/收腹机', '甩脂机', '踏步机', '运动护具', '瑜伽舞蹈', '武术搏击', '综合训练器', '其他大型器械', '其他中小型器材'],
				['山地车/公路车', '折叠车', '电动车', '平衡车', '其他整车', '骑行装备', '骑行服'],
				['乒乓球', '羽毛球', '篮球', '足球', '轮滑滑板', '网球', '高尔夫', '台球', '排球', '棋牌麻将', '其它'],
				['<img src="//img10.360buyimg.com/vclist/jfs/t2041/134/232322397/2043/52db2de/55f7e530Nbb297482.png" data-lazy-img="done" height="16">', '冲锋衣裤', '速干衣裤', '滑雪服', '羽绒服/棉服', '休闲衣裤', '抓绒衣裤', '软壳衣裤', 'T恤', '户外风衣', '功能内衣', '军迷服饰', '登山鞋', '徒步鞋', '越野跑鞋', '休闲鞋', '雪地靴', '工装鞋', '溯溪鞋', '沙滩/凉拖', '户外袜'],
				['背包', '帐篷/垫子', '睡袋/吊床', '登山攀岩', '户外照明', '野餐烧烤', '便携桌椅床', '户外工具', '望远镜', '户外仪表', '旅游用品', '军迷用品', '救援装备', '滑雪装备', '极限户外', '冲浪潜水', '户外配饰'],
				['鱼竿鱼线', '浮漂鱼饵', '钓鱼桌椅', '钓鱼配件', '钓箱鱼包', '其它'],
				['泳镜', '泳帽', '游泳包防水包', '男士泳衣', '女士泳衣', '比基尼', '其它']
			],
			[
				['微型车', '小型车', '紧凑型车', '中型车', '中大型车', '豪华车', 'MPV', 'SUV', '跑车'],
				['5万以下', '5-8万', '8-10万', '10-15万', '15-25万', '25-40万', '40万以上'],
				['一汽奔腾', '雷诺', '北汽新能源', '东南汽车', '海马汽车', 'MG名爵'],
				['润滑油', '添加剂', '防冻液', '滤清器', '火花塞', '雨刷', '车灯', '后视镜', '轮胎', '轮毂', '刹车片/盘', '维修配件', '蓄电池', '底盘装甲/护板', '贴膜', '汽修工具', '改装配件'],
				['导航仪', '安全预警仪', '行车记录仪', '倒车雷达', '蓝牙设备', '时尚影音', '净化器', '电源', '智能驾驶', '车载电台', '吸尘器', '冰箱'],
				['车蜡', '补漆笔', '玻璃水', '清洁剂', '洗车工具', '洗车配件'],
				['脚垫', '座垫', '座套', '后备箱垫', '头枕腰靠', '香水', '空气净化', '车内饰品', '功能小件', '车身装饰件', '车衣'],
				['安全座椅', '胎压监测', '充气泵', '防盗设备', '应急救援', '保温箱', '储物箱', '自驾野营', '摩托车装备'],
				['清洗美容服务', '功能升级服务', '保养维修服务']
			],
			[
				['婴幼奶粉', '成人奶粉'],
				['DHA', '钙铁锌/维生素', '益生菌/初乳', '清火/开胃', '米粉/菜粉', '果泥/果汁', '面条/粥', '宝宝零食'],
				['婴儿尿裤', '拉拉裤', '成人尿裤', '湿巾'],
				['宝宝护肤', '宝宝洗浴', '理发器', '洗衣液/皂', '奶瓶清洗', '日常护理', '座便器', '驱蚊防蚊'],
				['奶瓶奶嘴', '吸奶器', '牙胶安抚', '暖奶消毒', '辅食料理机', '碗盘叉勺', '水壶/水杯'],
				['婴儿床', '婴儿推车', '餐椅摇椅', '学步车', '三轮车', '自行车', '扭扭车', '滑板车', '电动车'],
				['提篮式', '安全座椅', '增高垫'],
				['婴儿外出服', '婴儿内衣', '婴儿礼盒', '婴儿鞋帽袜', '家居床品', '安全防护'],
				['妈咪包/背婴带', '待产/新生', '产后塑身', '文胸/内裤', '防辐射服', '孕妇装', '月子装', '孕期营养', '孕妈美容'],
				['套装', '上衣', '裙子', '裤子', '亲子装', '运动服', '功能鞋', '运动鞋', '皮鞋/帆布鞋', '凉鞋', '内衣', '配饰', '演出服', '羽绒服/棉服', '靴子'],
				['适用年龄', '遥控/电动', '毛绒布艺', '娃娃玩具', '模型玩具', '健身玩具', '动漫玩具', '益智玩具', '积木拼插', 'DIY玩具', '创意减压', '乐器相关']
			],
			[
				['白酒', '葡萄酒', '洋酒', '啤酒', '黄酒/养生酒', '收藏酒/陈年老酒'],
				['牛奶', '饼干蛋糕', '糖果/巧克力', '休闲零食', '冲调饮品', '粮油调味'],
				['休闲零食', '坚果炒货', '肉干肉脯', '蜜饯果干', '糖果/巧克力', '饼干蛋糕', '无糖食品'],
				['新疆', '四川', '云南', '湖南', '内蒙', '北京', '山西', '福建', '东北', '其他'],
				['铁观音', '普洱', '龙井', '绿茶', '红茶', '乌龙茶', '花草茶', '花果茶', '黑茶', '白茶', '养生茶', '其他茶'],
				['牛奶乳品', '饮料', '饮用水', '咖啡/奶茶', '蜂蜜/柚子茶', '冲饮谷物', '成人奶粉'],
				['米面杂粮', '食用油', '调味品', '南北干货', '方便食品', '有机食品'],
				['水果蔬菜', '海鲜水产', '海参', '牛排', '肉禽蛋奶', '熟食腊味', '环球美食', '产地直供'],
				['大闸蟹', '粽子', '月饼', '卡券']
			],
			[
				['调节免疫', '调节三高', '缓解疲劳', '美体塑身', '美容养颜', '肝肾养护', '肠胃养护', '明目益智', '骨骼健康', '改善睡眠', '抗氧化', '耐缺氧'],
				['维生素/矿物质', '蛋白质', '鱼油/磷脂', '螺旋藻', '番茄红素', '叶酸', '葡萄籽', '左旋肉碱', '辅酶Q10', '益生菌', '玛咖', '膳食纤维', '牛初乳', '胶原蛋白', '大豆异黄酮', '芦荟提取', '酵素'],
				['阿胶', '蜂蜜/蜂产品', '枸杞', '燕窝', '海参', '冬虫夏草', '人参/西洋参', '三七', '鹿茸', '雪蛤', '青钱柳', '石斛/枫斗', '灵芝/孢子粉', '当归', '养生茶饮', '药食同源'],
				['安全避孕', '验孕测孕', '人体润滑', '男用延时', '男用器具', '女用器具', '情趣内衣'],
				['血压计', '血糖仪', '血氧仪', '体温计', '体重秤', '胎心仪', '按摩器', '呼吸制氧', '雾化器', '助听器', '轮椅', '拐杖', '中医保健', '养生器械', '家庭护理', '智能健康'],
				['隐形眼镜', '护理液', '口罩', '眼罩/耳塞', '跌打损伤', '暖贴', '鼻喉护理', '眼部保健', '美体护理']
			],
			[
				['音乐', '影视', '教育音像', '游戏', '影视/动漫周边'],
				['0-2岁', '3-6岁', '7-10岁', '11-14岁', '儿童文学', '绘本', '科普', '幼儿启蒙', '手工游戏', '智力开发'],
				['教材', '中小学教辅', '考试', '外语学习', '字典词典'],
				['小说', '文学', '青春文学', '传记', '动漫', '艺术', '摄影'],
				['管理', '金融与投资', '经济', '励志与成功'],
				['历史', '心理学', '政治/军事', '国学/古籍', '哲学/宗教', '社会科学', '法律', '文化'],
				['家教与育儿', '孕产', '健身保健', '旅游/地图', '美食', '时尚美妆', '家居', '手工DIY', '两性', '体育'],
				['计算机与互联网', '科普', '建筑', '工业技术', '电子/通信', '医学', '科学与自然', '农林'],
				['杂志/期刊', '英文原版书', '港台图书'],
				['畅读VIP', '小说', '励志与成功', '经济金融', '文学', '社科', '婚恋两性', '外文原版', '免费'],
				['通俗流行', '古典音乐', '摇滚说唱', '爵士蓝调', '乡村民谣', '有声读物']
			],
			[
				['双色球', '福彩3D', '七乐彩', '新时时彩', '快3', '大乐透', '排列三', '七星彩', '新11选5', '11选5', '竞彩足球', '竞彩篮球', '北单', '足彩', '排列五'],
				['手机话费充值', '手机流量充值'],
				['QQ充值', '游戏点卡', '网页游戏', '游戏周边', '手机游戏', '单机游戏'],
				['外卖订座', '生活缴费', '健康丽人', '京品生活', '汽车养护'],
				['电影选座', '演唱会', '音乐会', '话剧歌剧', '体育赛事', '舞蹈芭蕾', '戏曲综艺'],
				['早教幼教', '艺术培训', '语言培训', '网络课程', '学习培训', '其它'],
				['企业差旅', '奖励旅游', '会议周边', '会议活动'],
				['国内机票', '国际机票'],
				['国内酒店', '特惠酒店'],
				['度假首页', '旅游团购', '旅行保险'],
				['全球签证', '景点门票'],
				['国内租车']
			],
			[
				['京东小金库', '票据理财', '基金理财', '保险理财', '金点点'],
				['智能硬件', '流行文化', '生活美学', '公益', '股权众筹', '其他权益众筹'],
				['京东白条', '旅游白条', '校园白条', '租房白条'],
				['京东钱包'],
				['健康险', '意外险', '旅行险']
			]
		]


	for (var i = 0; i < cate_tits.length; i++) {

		var block = $('<div class="block"></div>');
		var left = $('<div class="left"></div>');
		var hd = $('<div class="hd"></div>');
		for (var j = 0; j < cate_tits[i].length; j++) {
			var a = $('<a href="#"></a>');
			a.html(cate_tits[i][j]);
			hd.append(a);
		}
		left.append(hd);
		var bd = $('<div class="bd"></div>');
		for (var m = 0; m < dts[i].length; m++) {
			var dl = $('<dl></dl>');
			var dt = $('<dt></dt>');
			var a=$('<a href="#"></a>');

			a.html(dts[i][m]);
			dt.append(a);
			dl.append(dt);
			bd.append(dl);

			var dd=$('<dd></dd>');
			for (var n = 0; n < dds[i][m].length; n++) {
				var a=$('<a href="#"></a>');
				a.html(dds[i][m][n]);
				dd.append(a);
			}
			dl.append(dd);
		}

		left.append(bd);
		block.append(left);
		block.append($(right));
		
		categoryDD.append(block);	
	}

	categoryDD.find('.left').each(function(i){
		$(this).find('img').each(function(j){
			$(this).attr('src','products/cate/'+(i+1)+'/s'+(j+1)+'.jpg');
		});
	});
	$('#category-dd .right').each(function(i) {
		$(this).find('img').each(function(j) {
			$(this).attr('src', 'products/cate/' + (i + 1) + '/' + (j + 1) + '.jpg');
		});
	});
});